Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: If you still need some help to figure out who made these calls, how about being able to see the complete stack trace at each mock call?
it_it: Se c'è ancora bisogno di aiuto per capire chi ha effettuato queste chiamate, potrebbe essere utile poter vedere lo stack trace completo ad ogni chiamata mock?

source: If you think it says that turtle.GetX() will be called n times and will return 10, 20, 30, ..., consecutively, think twice!
it_it: Se si pensa che dica che turtle.GetX() verrà chiamato n volte e restituirà 10, 20, 30, ..., consecutivamente, ripensateci!

source: If you think it says that `turtle.GetX()` will be called `n` times and will return 10, 20, 30, ..., consecutively, think twice!
it_it: Se si pensa che dica che `turtle.GetX()` verrà chiamato `n` volte e restituirà 10, 20, 30, ..., consecutivamente, ripensateci!

source: If you try to run pkg-config with the correct PKG_CONFIG_LIBDIR=/home/MYUSER/sysroot/usr/lib64/pkgconfig against this .pc file, you will get
it_it: Provando ad eseguire pkg-config col PKG_CONFIG_LIBDIR=/home/MYUSER/sysroot/usr/lib64/pkgconfig corretto rispetto a questo file .pc, si ottiene

source: If you try to run `pkg-config` with the correct `PKG_CONFIG_LIBDIR=/home/MYUSER/sysroot/usr/lib64/pkgconfig` against this `.pc` file, you will get
it_it: Provando ad eseguire `pkg-config` col `PKG_CONFIG_LIBDIR=/home/MYUSER/sysroot/usr/lib64/pkgconfig` corretto rispetto a questo file `.pc`, si otterrà

source: If you use gtest_main, you need to call this before main() starts for it to take effect.
it_it: Se si usa gtest_main, lo si deve chiamare pria dell'avvio di main() affinché abbia effetto.

source: If you use `gtest_main`, you need to call this before `main()` starts for it to take effect.
it_it: Se si usa `gtest_main`, lo si deve chiamare prima dell'avvio di `main()` affinché abbia effetto.

source: If you use a user-defined type FooType in an assertion, you must make sure there is an std::ostream& operator<<(std::ostream&, const FooType&) function defined such that we can print a value of FooType.
it_it: Se si usa un tipo definito dall'utente FooType in un'asserzione, ci dev'essere una funzione std::ostream& operator<<(std::ostream&, const FooType&) definita in modo tale da poter stampare un valore di FooType.

source: If you use a user-defined type `FooType` in an assertion, you must make sure there is an `std::ostream& operator<<(std::ostream&, const FooType&)` function defined such that we can print a value of `FooType`.
it_it: Se si usa un tipo definito dall'utente `FooType` in un'asserzione, ci dev'essere una funzione `std::ostream& operator<<(std::ostream&, const FooType&)` definita in modo tale da poter stampare un valore di `FooType`.

source: If you violate the rule, there may not be immediate consequences, but your test may (just may) break with a new compiler (or a new version of the compiler you are using) or with a new version of GoogleTest.
it_it: Violando la regola, potrebbero non esserci conseguenze immediate, ma il test potrebbe (solo potrebbe) "rompersi" con un nuovo compilatore (o una nuova versione del compilatore utilizzato) o con una nuova versione di GoogleTest.

source: If you violate the rules (for example, if you set expectations on a mock while another thread is calling its methods), you get undefined behavior.
it_it: Se si violano le regole (ad esempio, se si impostano le expectation su un mock mentre un altro thread ne chiama i metodi), si otterrà un comportamento indefinito.

source: If you want your test fixtures and tests to be friends of your class, then they must be defined in the exact same namespace (no anonymous or inline namespaces).
it_it: Se si vuole che le fixture e i test siano friend della classe, allora devono essere definiti esattamente nello stesso namespace (nessun namespace anonimo o inline).

source: If you want greater precision, use ASSERT_NEAR (2.00001, 2.000011, 0.0000001) and you receive the error shown in Listing 10.
it_it: Per una maggiore precisione, utilizzare ASSERT_NEAR (2.00001, 2.000011, 0.0000001) e si riceverà l'errore mostrato nel Listato 10.

source: If you want informative messages in EXPECT_FALSE and ASSERT_FALSE as well (one third of Boolean assertions in the Google code base are negative ones), and are fine with making the predicate slower in the success case, you can supply a success message:
it_it: Per ottenere messaggi informativi anche in EXPECT_FALSE e in ASSERT_FALSE (un terzo delle asserzioni booleane nel codebase di Google sono negative) e si è d'accordo nel rendere il predicato più lento in il caso di successo, si può fornire un messaggio in caso di successo:

source: If you want informative messages in `EXPECT_FALSE` and `ASSERT_FALSE` as well (one third of Boolean assertions in the Google code base are negative ones), and are fine with making the predicate slower in the success case, you can supply a success message:
it_it: Per ottenere messaggi informativi anche in `EXPECT_FALSE` e in `ASSERT_FALSE` (un terzo delle asserzioni booleane nel codebase di Google sono negative) e si è d'accordo nel rendere il predicato più lento in il caso di successo, si può fornire un messaggio in caso di successo:

source: If you want the side effect to happen every time, you need to define a custom action, which we'll teach in the cook book.
it_it: Se si vuole che l'effetto collaterale si verifichi ogni volta, si deve definire un'azione personalizzata, che illustreremo nel cook book.

source: If you want the side effect to happen every time, you need to define a custom action, which we'll teach in the [cook book](gmock_cook_book.md).
it_it: Se si vuole che l'effetto collaterale si verifichi ogni volta, si deve definire un'azione personalizzata, che illustreremo nel [cook book](gmock_cook_book.md).

source: If you want to write the elements in-line, match them more flexibly, or get more informative messages, you can use:
it_it: Per scrivere gli elementi in linea, abbinarli in modo più flessibile o ricevere messaggi più informativi, si possono utilizzare:

source: If you want to catch failures in other threads as well, use one of the following macros instead:
it_it: Per rilevare errori anche in altri thread, si utilizza invece una delle seguenti macro:

source: If you want to continue running the disabled tests, pass the -gtest_also_run_disabled_tests option on the command line.
it_it: Per continuare a eseguire i test disabilitati, si passa l'opzione -gtest_also_run_disabled_tests sulla riga di comando.

source: If you want to explicitly specify the value argument types, you can provide additional template arguments:
it_it: Per specificare esplicitamente i tipi degli argomenti valore, si possono fornire argomenti template aggiuntivi:

source: If you want to help, you can volunteer to implement the necessary synchronization primitives in gtest-port.h for your platform.
it_it: Se si vuole aiutare, ci si può offrire volontari per implementare le primitive di sincronizzazione necessarie in gtest-port.h per la propria piattaforma.

source: If you want to help, you can volunteer to implement the necessary synchronization primitives in `gtest-port.h` for your platform.
it_it: Se si vuole aiutare, ci si può offrire volontari per implementare le primitive di sincronizzazione necessarie in `gtest-port.h` per la propria piattaforma.

source: If you want to print a value x using GoogleTest's value printer yourself, just call ::testing::PrintToString(x), which returns an std::string:
it_it: Per stampare in proprio un valore x utilizzando la stampante dei valori di GoogleTest, basta chiamare ::testing::PrintToString(x), che restituisce una std::string:

source: If you want to print a value `x` using GoogleTest's value printer yourself, just call `::testing::PrintToString(x)`, which returns an `std::string`:
it_it: Per stampare in proprio un valore `x` utilizzando la stampante dei valori di GoogleTest, basta chiamare `::testing::PrintToString(x)`, che restituisce una `std::string`:

source: If you want to run only the positive unit tests from SquareRootTest, use --gtest_filter=SquareRootTest.*-SquareRootTest.Zero*.
it_it: Per eseguire solo le unit test positive da SquareRootTest, si usa --gtest_filter=SquareRootTest.*-SquareRootTest.Zero*.

source: If you want to suppress the UTF-8 text because, for example, you don't have an UTF-8 compatible output medium, run the test program with --gtest_print_utf8=0 or set the GTEST_PRINT_UTF8 environment variable to 0.
it_it: Per sopprimere il testo UTF-8 perché, ad esempio, non si dispone di un supporto di output compatibile con UTF-8, si esegue il programma di test con --gtest_print_utf8=0 o si setta la variabile di ambiente GTEST_PRINT_UTF8 con 0.

source: If you want to suppress the UTF-8 text because, for example, you don't have an UTF-8 compatible output medium, run the test program with `--gtest_print_utf8=0` or set the `GTEST_PRINT_UTF8` environment variable to `0`.
it_it: Per sopprimere il testo UTF-8 perché, ad esempio, non si dispone di un supporto di output compatibile con UTF-8, si esegue il programma di test con `--gtest_print_utf8=0` o si setta la variabile di ambiente `GTEST_PRINT_UTF8` con `0`.

source: If you want to test EXPECT_*()/ASSERT_*() failures in your test code, see "Catching" Failures.
it_it: Per testare gli errori EXPECT_*()/ASSERT_*() nel codice, consultare "Catching" degli Errori.

source: If you want to test `EXPECT_*()/ASSERT_*()` failures in your test code, see ["Catching" Failures](#catching-failures).
it_it: Per testare gli errori `EXPECT_*()/ASSERT_*()` nel codice, consultare ["Catching" degli Errori](#catching-failures).

source: If you want to throw an exception from this function to skip to the next test, it must be an AssertionException or inherited from it.
it_it: Per lanciare un'eccezione da questa funzione per passare al test successivo, deve essere una AssertionException o ereditata da essa.

source: If you want to throw an exception from this function to skip to the next test, it must be an [`AssertionException`](#AssertionException) or inherited from it.
it_it: Per lanciare un'eccezione da questa funzione per passare al test successivo, deve essere una [`AssertionException`](#AssertionException) o ereditata da essa.

source: If you want to verify exceptions thrown by your code, see Exception Assertions.
it_it: Per verificare le eccezioni generate dal codice, consultare Asserzioni di Eccezioni.

source: If you want to verify exceptions thrown by your code, see [Exception Assertions](#ExceptionAssertions).
it_it: Per verificare le eccezioni generate dal codice, consultare [Exception Assertions](#ExceptionAssertions).

source: If you want to verify that a method is called with a particular argument but the match criteria is complex, it can be difficult to distinguish between cardinality failures (calling the method the wrong number of times) and argument match failures.
it_it: Per verificare che un metodo venga chiamato con un argomento particolare ma i criteri di corrispondenza [match] sono complessi, può essere difficile distinguere tra errori di cardinalità (chiamare il metodo il numero sbagliato di volte) e gli errori di corrispondenza [match] dell'argomento.

source: If you want your death tests to work in all cases, you can either #if on these macros or use the more limited syntax only.
it_it: Per far funzionare in ogni caso i death test, si può usare #if con queste macro o usare solo la sintassi più limitata.

source: If you want your death tests to work in all cases, you can either `#if` on these macros or use the more limited syntax only.
it_it: Per far funzionare in ogni caso i death test, si può usare `#if` con queste macro o usare solo la sintassi più limitata.

source: If you want, you can still override the default action by providing your own ON_CALL() or using .WillOnce() / .WillRepeatedly() in EXPECT_CALL().
it_it: Volendo, si può comunque sovrascrivere l'azione di default fornendo la propria ON_CALL() o utilizzando .WillOnce() / .WillRepeatedly() in EXPECT_CALL().

source: If you want, you can still override the default action by providing your own `ON_CALL()` or using `.WillOnce()` / `.WillRepeatedly()` in `EXPECT_CALL()`.
it_it: Volendo, si può comunque sovrascrivere l'azione di default fornendo la propria `ON_CALL()` o utilizzando `.WillOnce()` / `.WillRepeatedly()` in `EXPECT_CALL()`.

source: If you would rather have all calls occur in the order of the expectations, put the EXPECT_CALL() statements in a block where you define a variable of type InSequence:
it_it: Se si preferisce che tutte le chiamate avvengano nell'ordine previsto, inserire le istruzioni EXPECT_CALL() in un blocco in cui si definisce una variabile di tipo InSequence:

source: If you would rather have all calls occur in the order of the expectations, put the `EXPECT_CALL()` statements in a block where you define a variable of type `InSequence`:
it_it: Se si preferisce che tutte le chiamate avvengano nell'ordine previsto, inserire le istruzioni `EXPECT_CALL()` in un blocco in cui si definisce una variabile di tipo `InSequence`:

source: If you write code that sniffs whether it's running in a test and does different things accordingly, you are leaking test-only logic into production code and there is no easy way to ensure that the test-only code paths aren't run by mistake in production.
it_it: Se si scrive codice che "annusa" se è in esecuzione in un test e fa cose diverse di conseguenza, si sta perdendo la logica "test-only" nel codice di produzione e non esiste un modo semplice per garantire che i percorsi del codice test-only non vengano eseguiti per errore in produzione.

source: If you write your own main function, it should return the value of RUN_ALL_TESTS().
it_it: Se si scrive la propria funzione main, essa deve restituire il valore di RUN_ALL_TESTS().

source: If you write your own `main` function, it should return the value of `RUN_ALL_TESTS()`.
it_it: Se si scrive la propria funzione `main`, essa deve restituire il valore di `RUN_ALL_TESTS()`.

source: If you're like us, you'd like to look at googletest samples. The sample directory has a number of well-commented samples showing how to use a variety of googletest features.
it_it: Sarete certamente interessati a dare un'occhiata agli esempi di googletest. La directory "samples" contiene una serie di esempi ben commentati che mostrano come utilizzare diverse funzioni di googletest.

source: If you're like us, you'd like to look at [googletest samples.](https://github.com/google/googletest/blob/main/googletest/samples) The sample directory has a number of well-commented samples showing how to use a variety of googletest features.
it_it: Sarete certamente interessati a dare un'occhiata agli [esempi di googletest](https://github.com/google/googletest/blob/main/googletest/samples). La directory "samples" contiene una serie di esempi ben commentati che mostrano come utilizzare diverse funzioni di googletest.

source: If you're mocking a const method, add a 4th parameter containing (const) (the parentheses are required).
it_it: Per mock-are un metodo const, si aggiunge un 4° parametro contenente (const) (le parentesi sono obbligatorie).

source: If you're mocking a const method, add a 4th parameter containing `(const)` (the parentheses are required).
it_it: Per mock-are un metodo const, si aggiunge un 4° parametro contenente `(const)` (le parentesi sono obbligatorie).

source: If your main() function ignores it, your test will be considered successful even if it has a GoogleTest assertion failure.
it_it: Se la funzione main() lo ignora, il test verrà considerato riuscito anche se presenta un errore nell'asserzione di GoogleTest.

source: If your `main()` function ignores it, your test will be considered successful even if it has a GoogleTest assertion failure.
it_it: Se la funzione `main()` lo ignora, il test verrà considerato riuscito anche se presenta un errore nell'asserzione di GoogleTest.

source: If your class has a static data member:
it_it: Se la classe ha un membro dati static:

source: If your code interacts with a naggy mock, however, you may start to get spammed with warnings as the result of your change.
it_it: Se il codice interagisce con un mock "naggy", però, si potrebbe iniziare a ricevere notevoli warning come risultato della modifica.

source: If your mock function doesn't use the default calling convention, you can specify it by adding Calltype(convention) to MOCK_METHOD's 4th parameter.
it_it: Se la funzione mock non utilizza la convenzione di chiamata di default, la si può specificare aggiungendo Calltype(convention) al quarto parametro di MOCK_METHOD.

source: If your mock function doesn't use the default calling convention, you can specify it by adding `Calltype(convention)` to `MOCK_METHOD`'s 4th parameter.
it_it: Se la funzione mock non utilizza la convenzione di chiamata di default, la si può specificare aggiungendo `Calltype(convention)` al quarto parametro di `MOCK_METHOD`.

source: If your mock function takes a pointer argument and you want to delete that argument, you can use testing::DeleteArg
it_it: Se la funzione mock accetta un argomento puntatore e si vuole eliminare quell'argomento, si può utilizzare `testing::DeleteArg

source: If your mock function takes a pointer argument and you want to delete that argument, you can use testing::DeleteArg<N>() to delete the N'th (zero-indexed) argument:
it_it: Se la funzione mock accetta un argomento puntatore e si vuole eliminare quell'argomento, si può utilizzare testing::DeleteArg<N>() per il delete dell'N-esimo argomento (partendo da zero):

source: If your mocks have different behaviors than the real objects by mistake, you could end up with code that passes the tests but fails in production.
it_it: Se per errore i mock hanno comportamenti diversi rispetto agli oggetti reali, ci si potrebbe ritrovare con un codice che supera i test ma fallisce in produzione.

source: If your project uses Bazel, see the Quickstart for Bazel instead.
it_it: Se il progetto utilizza Bazel, consultare invece Quickstart for Bazel.

source: If your project uses Bazel, see the [Quickstart for Bazel](quickstart-bazel.md) instead.
it_it: Se il progetto utilizza Bazel, consultare invece [Quickstart for Bazel](quickstart-bazel.md).

source: If your test doesn't care about the parameters (it only cares about the number or order of calls), you can often simply omit the parameter list:
it_it: Se il test non si preoccupa dei parametri (si preoccupa solo del numero o dell'ordine delle chiamate), spesso si può semplicemente omettere l'elenco dei parametri:

source: If your test program contains global set-up/tear-down code, it will be repeated in each iteration as well, as the flakiness may be in it.
it_it: Se il programma di test contiene codice set-up/tear-down globale, verrà ripetuto anche in ogni iterazione, poiché potrebbe esserci qualche instabilità.

source: If your test program contains [global set-up/tear-down](#global-set-up-and-tear-down) code, it will be repeated in each iteration as well, as the flakiness may be in it.
it_it: Se il programma di test contiene codice [set-up/tear-down globale](#global-set-up-and-tear-down), verrà ripetuto anche in ogni iterazione, poiché potrebbe esserci qualche instabilità.

source: If, however, the third Forward(10) call is replaced by Forward(20), then it would be OK, as now #1 will be the matching expectation.
it_it: Se, tuttavia, la terza chiamata Forward(10) viene sostituita da Forward(20), allora andrebbe bene, poiché ora #1 sarà la expectation corrispondente.

source: If, however, the third `Forward(10)` call is replaced by `Forward(20)`, then it would be OK, as now #1 will be the matching expectation.
it_it: Se, tuttavia, la terza chiamata `Forward(10)` viene sostituita da `Forward(20)`, allora andrebbe bene, poiché ora #1 sarà la expectation corrispondente.

source: If, however, we try to simplify this interface, we'll need to fix all clients depending on it, which is often infeasible.
it_it: Se, tuttavia, proviamo a semplificare questa interfaccia, dovremo sistemare tutti i client che dipendono da essa, il che spesso è irrealizzabile.

source: If, however, you still want to pass a parameter by reference, be aware that in the failure message generated by the matcher you will see the value of the referenced object but not its address.
it_it: Se però si deve comunque passare un parametro per riferimento, si tenga presente che nel messaggio di errore generato dal matcher si vedrà il valore dell'oggetto referenziato ma non il suo indirizzo.

source: If, however, you are sure that the calls are OK, you can write
it_it: Se invece si è sicuri che le chiamate siano andate bene si può scrivere

source: If, however, you find yourself in the position to write a mock class, relax - gMock turns this task into a fun game!
it_it: Se, tuttavia, ci si trova nella posizione di scrivere una classe mock, si può stare tranquilli: gMock trasforma questo compito in un gioco divertente!

source: Ignoring Arguments in Action Functions
it_it: Ignorare gli Argomenti nella Funzioni Azioni

source: Ignoring Uninteresting Arguments {#ParameterlessExpectations}
it_it: Ignorare gli Argomenti Non Interessanti {#ParameterlessExpectations}

source: Ignoring Uninteresting Calls
it_it: Ignorare le Chiamate [Uninteresting]

source: Ignoring an Action's Result
it_it: Ignorare un Risultato di un'Azione

source: Imagine you have a mock function that takes an object of type Foo, which has an int bar() method and an int baz() method.
it_it: Immaginiamo di avere una funzione mock che accetta un oggetto di tipo Foo, che ha un metodo int bar() e un metodo int baz().

source: Imagine you have a mock function that takes an object of type `Foo`, which has an `int bar()` method and an `int baz()` method.
it_it: Immaginiamo di avere una funzione mock che accetta un oggetto di tipo `Foo`, che ha un metodo `int bar()` e un metodo `int baz()`.

source: Import the gMock names from the testing namespace such that you can use them unqualified (You only have to do it once per file).
it_it: Si importano i nomi gMock dal namespace testing in modo da poterli utilizzare senza qualificarli (lo si deve fare solo una volta per file).

source: Import the gMock names from the `testing` namespace such that you can use them unqualified (You only have to do it once per file).
it_it: Si importano i nomi gMock dal namespace `testing` in modo da poterli utilizzare senza qualificarli (lo si deve fare solo una volta per file).

source: Import the gMock names you need to use.
it_it: Si importano i nomi gMock da utilizzare.

source: In // particular, they can be inside a loop.
it_it: In // particolare, possono trovarsi all'interno di un loop.

source: In addition, NiceMock<T> can be constructed with any arguments that a constructor of T accepts.
it_it: Inoltre, NiceMock<T> può essere costruito con qualsiasi argomento accettato dal costruttore di T.

source: In addition, in C++ 11 and above, a mock function whose return type is default-constructible (i.e. has a default constructor) has a default action of returning a default-constructed value.
it_it: Inoltre, in C++ 11 e nelle versioni successive, una funzione mock il cui tipo restituito è default-constructible (ovvero ha un costruttore di default) ha un'azione di default che restituisce un valore costruito dal default.

source: In order to test your code that uses such a class (let's call it Concrete), you may be tempted to make the methods of Concrete virtual and then mock it.
it_it: Per testare il codice che utilizza una classe di questo tipo (chiamiamola Concrete), si potrebbe essere tentati di rendere virtuali i metodi di Concrete e crearne il mock.
